---
kind: type
id: T:Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs
source: html/682bcbf4-9367-5b9d-0fcf-1a57885f3e65.htm
---
# Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs

The event arguments used by ComboBox's CurrentChanged event.

## Syntax (C#)
```csharp
public class ComboBoxCurrentChangedEventArgs : RibbonItemEventArgs
```